In [5]:
import pandas as pd

In [3]:
data ={
    'kholi':[1,2,3,4,5],
    'dhawan':[10,20,30,40,50]
}

In [10]:
scores = pd.DataFrame(data)
scores
pd.

NameError: name 'colnames' is not defined

In [8]:
type(data)

dict

In [15]:
data ={
    "mango":[150,200,150,100,90,70],
    "banana":[15,20,15,10,9,7]
}

In [17]:
df = pd.DataFrame(data,index = ['jan','feb','mar','apr','may','jun'])
df

     mango  banana
jan    150      15
feb    200      20
mar    150      15
apr    100      10
may     90       9
jun     70       7

In [18]:
 df.iloc[:,0] # number based indexing

jan    150
feb    200
mar    150
apr    100
may     90
jun     70
Name: mango, dtype: int64

In [19]:
 df.loc[:,'mango'] #label indexing

jan    150
feb    200
mar    150
apr    100
may     90
jun     70
Name: mango, dtype: int64

In [30]:
 print(df['mango']['apr'])
print( df.iloc[3,0]   )

100
100

In [32]:
import os
os.listdir()

['.ipynb_checkpoints',
 '02_-_Day_-_2_-_Python_Basics_notebook.ipynb',
 'Assignment',
 'Assignment_tuple_set_dic (1).ipynb',
 'Basic.ipynb',
 'Exercise_-_Day2.ipynb',
 'function.ipynb',
 'Loops_and_Functions.ipynb',
 'my_Numpy.ipynb',
 'my_pandas.ipynb',
 'Numpy.ipynb',
 'package_test.ipynb',
 'python_conditional loops.ipynb',
 'sandclock.ipynb',
 'set_tuple.ipynb',
 'string.ipynb',
 'Untitled.ipynb',
 'Untitled1.ipynb']

In [33]:
os.getcwd()

'C:\\Users\\Aneetha\\Desktop\\Inceptz_DS\\python'

In [34]:
!pip install pysqlite3

Collecting pysqlite3
  Downloading pysqlite3-0.4.3.tar.gz (40 kB)
Building wheels for collected packages: pysqlite3
  Building wheel for pysqlite3 (setup.py): started
  Building wheel for pysqlite3 (setup.py): finished with status 'done'
  Running setup.py clean for pysqlite3
Failed to build pysqlite3
Installing collected packages: pysqlite3
    Running setup.py install for pysqlite3: started
    Running setup.py install for pysqlite3: finished with status 'done'
Successfully installed pysqlite3

  WARNING: Legacy build of wheel for 'pysqlite3' created no files.
  Command arguments: 'C:\Users\Aneetha\anaconda3\python.exe' -u -c 'import sys, setuptools, tokenize; sys.argv[0] = '"'"'C:\\Users\\Aneetha\\AppData\\Local\\Temp\\pip-install-ldcg2sih\\pysqlite3\\setup.py'"'"'; __file__='"'"'C:\\Users\\Aneetha\\AppData\\Local\\Temp\\pip-install-ldcg2sih\\pysqlite3\\setup.py'"'"';f=getattr(tokenize, '"'"'open'"'"', open)(__file__);code=f.read().replace('"'"'\r\n'"'"', '"'"'\n'"'"');f.close();exec(compile(code, __file__, '"'"'exec'"'"'))' bdist_wheel -d 'C:\Users\Aneetha\AppData\Local\Temp\pip-wheel-xifbieca'
  Command output: [use --verbose to show]

In [36]:
import sqlite3

In [42]:
file_name = "C:\Users\Aneetha\Desktop\Inceptz_DS\source\database.db"

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (<ipython-input-42-6d0bd781a782>, line 1)

In [49]:
df =pd.read_csv('https://raw.githubusercontent.com/codeforamerica/ohana-api/master/data/sample-csv/addresses.csv')

              id  location_id
count  21.000000    21.000000
mean   11.000000    11.095238
std     6.204837     6.363213
min     1.000000     1.000000
25%     6.000000     6.000000
50%    11.000000    11.000000
75%    16.000000    16.000000
max    21.000000    22.000000

In [80]:
df.shape
df.head()

,id,location_id,address_1,address_2,city,state_province,postal_code,country
0,1,1,2600 Middlefield Road,NaN,Redwood City,CA,94063,US
1,2,2,24 Second Avenue,NaN,San Mateo,CA,94401,US
2,3,3,24 Second Avenue,NaN,San Mateo,CA,94403,US
3,4,4,24 Second Avenue,NaN,San Mateo,CA,94401,US
4,5,5,24 Second Avenue,NaN,San Mateo,CA,94401,US

In [86]:
df['city'].describe()

count               21
unique               7
top       Redwood City
freq                 8
Name: city, dtype: object

In [50]:
 df.isna().sum()

id                 0
location_id        0
address_1          0
address_2         19
city               0
state_province     0
postal_code        0
country            0
dtype: int64

In [66]:
df.shape
df.columns
df.columns.dtype
df.dtypes

id                 int64
location_id        int64
address_1         object
address_2         object
city              object
state_province    object
postal_code       object
country           object
dtype: object

In [69]:
duplicated_df= df.drop_duplicates()

In [70]:
duplicated_df.shape

(21, 8)

In [79]:
df['state_province'].value_counts()
df['city'].value_counts()

Redwood City           8
San Mateo              5
Menlo Park             3
San Francisco          2
Belmont                1
South San Francisco    1
Sunnyvale              1
Name: city, dtype: int64

In [78]:
df['state_province'].unique()
df['city'].unique()

array(['Redwood City', 'San Mateo', 'Menlo Park', 'San Francisco',
       'Sunnyvale', 'South San Francisco', 'Belmont'], dtype=object)

In [90]:
df.loc[(df['city'].isin(['Belmont']))]

,id,location_id,address_1,address_2,city,state_province,postal_code,country
19,20,21,123 El Camino Real,NaN,Belmont,CA,94002,US

In [95]:
lst_columns =list(df.columns.values)
lst_columns
for i in df.values:
    print(i)

[1 1 '2600 Middlefield Road' nan 'Redwood City' 'CA' '94063' 'US']
[2 2 '24 Second Avenue' nan 'San Mateo' 'CA' '94401' 'US']
[3 3 '24 Second Avenue' nan 'San Mateo' 'CA' '94403' 'US']
[4 4 '24 Second Avenue' nan 'San Mateo' 'CA' '94401' 'US']
[5 5 '24 Second Avenue' nan 'San Mateo' 'CA' '94401' 'US']
[6 6 '800 Middle Avenue' nan 'Menlo Park' 'CA' '94025-9881' 'US']
[7 7 '500 Arbor Road' nan 'Menlo Park' 'CA' '94025' 'US']
[8 8 '800 Middle Avenue' nan 'Menlo Park' 'CA' '94025-9881' 'US']
[9 9 '2510 Middlefield Road' nan 'Redwood City' 'CA' '94063' 'US']
[10 10 '1044 Middlefield Road' nan 'Redwood City' 'CA' '94063' 'US']
[11 11 '2140 Euclid Avenue.' nan 'Redwood City' 'CA' '94061' 'US']
[12 12 '1044 Middlefield Road' '2nd Floor' 'Redwood City' 'CA' '94063'
 'US']
[13 13 '399 Marine Parkway.' nan 'Redwood City' 'CA' '94065' 'US']
[14 14 '660 Veterans Blvd.' nan 'Redwood City' 'CA' '94063' 'US']
[15 15 '1500 Valencia Street' nan 'San Francisco' 'CA' '94110' 'US']
[16 16 '1161 South Bernardo' nan 'Sunnyvale' 'CA' '94087' 'US']
[17 17 '409 South Spruce Avenue' nan 'South San Francisco' 'CA' '94080'
 'US']
[18 18 '114 Fifth Avenue' nan 'Redwood City' 'CA' '94063' 'US']
[19 19 '19 West 39th Avenue' nan 'San Mateo' 'CA' '94403' 'US']
[20 21 '123 El Camino Real' nan 'Belmont' 'CA' '94002' 'US']
[21 22 '2013 Avenue of the fellows' 'Suite 100' 'San Francisco' 'CA'
 '94103' 'US']

In [96]:
df['city'].value_counts().values

array([8, 5, 3, 2, 1, 1, 1], dtype=int64)

In [98]:
df['city'].values

array(['Redwood City', 'San Mateo', 'San Mateo', 'San Mateo', 'San Mateo',
       'Menlo Park', 'Menlo Park', 'Menlo Park', 'Redwood City',
       'Redwood City', 'Redwood City', 'Redwood City', 'Redwood City',
       'Redwood City', 'San Francisco', 'Sunnyvale',
       'South San Francisco', 'Redwood City', 'San Mateo', 'Belmont',
       'San Francisco'], dtype=object)